In [3]:
import sqlite3
import pandas as pd
df = pd.read_csv(r"C:\Users\USER\Desktop\Telecom Customer Churn Dataset.csv")
conn = sqlite3.connect("churn.db")
df.to_sql("customers", conn, if_exists="replace", index=False)

7043

In [7]:
query = """
SELECT 
    Churn,
    COUNT(*) * 100.0 / (SELECT COUNT(*) FROM customers) AS churn_percentage
FROM customers
GROUP BY Churn;
"""
pd.read_sql(query, conn)

  Churn  churn_percentage
0    No         73.463013
1   Yes         26.536987

In [8]:
query = """
SELECT 
    Churn,
    ROUND(AVG(MonthlyCharges), 2) AS avg_monthly_charges
FROM customers
GROUP BY Churn;
"""
pd.read_sql(query, conn)

  Churn  avg_monthly_charges
0    No                61.27
1   Yes                74.44

In [9]:
query = """
SELECT 
    Contract,
    Churn,
    COUNT(*) AS customer_count
FROM customers
GROUP BY Contract, Churn
ORDER BY Contract;
"""
pd.read_sql(query, conn)

         Contract Churn  customer_count
0  Month-to-month    No            2220
1  Month-to-month   Yes            1655
2        One year    No            1307
3        One year   Yes             166
4        Two year    No            1647
5        Two year   Yes              48